espressif/arduino-esp32/libraries/BluetoothSerial/src/BluetoothSerial.cpp
// Copyright 2018-2026 Espressif Systems (Shanghai) PTE LTD
// Copyright 2018 Evandro Luis Copercini
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

/**
 * @file BluetoothSerial.cpp
 * @brief BR/EDR Serial Port Profile (SPP) implementation.
 *
 * Spec references:
 *  - Serial Port Profile (SPP) v1.2 — defines service record, RFCOMM channel
 *    negotiation, and data transport over RFCOMM.
 *  - RFCOMM with TS 07.10 — BT Core Spec v5.x, Vol 4, Part E (transport layer
 *    that SPP relies on for framing and flow control).
 *  - BR/EDR Generic Access Profile (GAP) — BT Core Spec v5.x, Vol 3, Part C
 *    (inquiry/discovery, device name, scan modes).
 *  - Secure Simple Pairing (SSP) — BT Core Spec v5.x, Vol 2, Part C, Section 4
 *    (numeric comparison, passkey entry, OOB, Just Works; replaces legacy PIN
 *    pairing for devices advertising SSP support).
 *  - Legacy Pairing — BT Core Spec v5.x, Vol 2, Part C, Section 4.1
 *    (PIN-code-based authentication for BR/EDR devices that do not support SSP).
 */

#include "sdkconfig.h"
#include "soc/soc_caps.h"
#if SOC_BT_SUPPORTED && defined(CONFIG_BT_ENABLED) && defined(CONFIG_BLUEDROID_ENABLED)

#include "BluetoothSerial.h"
#include "esp32-hal-bt.h"
#include "esp32-hal-alloc-bt-classic-mem.h"
#include "esp32-hal-log.h"

#include <esp_bt.h>
#include <esp_bt_main.h>
#include <esp_bt_device.h>
#include <esp_gap_bt_api.h>
#include <esp_spp_api.h>
#include <cstring>

// CONFIG_BTDM_CTRL_BR_EDR_MAX_ACL_CONN_EFF: controller ceiling on simultaneous
// BR/EDR ACL links (=2 in the shipped esp32 sdkconfig).
#if defined(CONFIG_BTDM_CTRL_BR_EDR_MAX_ACL_CONN_EFF)
static constexpr size_t kMaxSppPeers = CONFIG_BTDM_CTRL_BR_EDR_MAX_ACL_CONN_EFF;
#elif defined(CONFIG_BTDM_CONTROLLER_BR_EDR_MAX_ACL_CONN_EFF)
static constexpr size_t kMaxSppPeers = CONFIG_BTDM_CONTROLLER_BR_EDR_MAX_ACL_CONN_EFF;
#elif defined(CONFIG_BT_ACL_CONNECTIONS)
static constexpr size_t kMaxSppPeers = CONFIG_BT_ACL_CONNECTIONS;
#else
static constexpr size_t kMaxSppPeers = 2;
#endif

// Per-byte rx ring; 512 is a practical default that fits typical SPP workloads.
static constexpr uint16_t RX_QUEUE_SIZE = 512;
// Packet-pointer tx ring; each slot holds a malloc'd spp_packet_t*.
static constexpr uint16_t TX_QUEUE_SIZE = 32;
// Maximum payload bytes per esp_spp_write() call.  RFCOMM with TS 07.10
// supports N1 (frame size) up to 32767 octets; the default negotiated N1 is
// 127 bytes but ESP-IDF's SPP layer accepts up to ~600+ bytes per write.
// 330 bytes is a conservative limit that fits within a few RFCOMM DH5 frames.
// SPP v1.2, §5.2; BT Core Spec v5.x, Vol 4, Part E (RFCOMM), §5.5.3
static constexpr uint16_t SPP_TX_MAX = 330;
static constexpr const char *DEFAULT_SPP_NAME = "ESP32SPP";

// Event group bits for SPP state
static constexpr EventBits_t SPP_RUNNING = BIT0;
static constexpr EventBits_t SPP_CONNECTED = BIT1;
static constexpr EventBits_t SPP_DISCONNECTED = BIT2;

// Event group bits for BT discovery state and bond removal
static constexpr EventBits_t BT_DISCOVERY_RUNNING = BIT0;
static constexpr EventBits_t BT_DISCOVERY_COMPLETED = BIT1;
static constexpr EventBits_t BT_BOND_REMOVE_COMPLETED = BIT2;

struct spp_packet_t {
  size_t len;
  bool broadcast;
  uint8_t targetAddr[6];
  uint8_t data[];
};

struct PeerState {
  uint32_t handle = 0;
  BTAddress address;
  bool congested = false;
};

// --------------------------------------------------------------------------
// BluetoothSerial::Impl -- all state is instance-owned
// --------------------------------------------------------------------------

struct BluetoothSerial::Impl {
  // SPP state
  std::vector<PeerState> peers;
  SemaphoreHandle_t peersMtx = nullptr;
  QueueHandle_t rxQueue = nullptr;
  QueueHandle_t txQueue = nullptr;
  SemaphoreHandle_t txDone = nullptr;
  EventGroupHandle_t sppEventGroup = nullptr;
  EventGroupHandle_t btEventGroup = nullptr;
  TaskHandle_t txTaskHandle = nullptr;

  String localName;
  bool isInitiator = false;
  bool initialized = false;
  bool sspEnabled = false;
  bool ioCapInput = false;
  bool ioCapOutput = false;

  uint8_t pinCode[16] = {};
  uint8_t pinCodeLen = 0;

  uint8_t txBuffer[SPP_TX_MAX] = {};
  size_t txBufferLen = 0;

  // Callbacks
  DataHandler dataCb;
  PeerDataHandler peerDataCb;
  PeerConnectHandler connectCb;
  PeerDisconnectHandler disconnectCb;
  ConfirmRequestHandler confirmRequestCb;
  AuthCompleteHandler authCompleteCb;
  DiscoveryHandler discoveryCb;

  // Discovery results
  std::vector<BluetoothSerial::DiscoveryResult> discoveryResults;

  // Connection target for name-based connect
  String targetName;
  uint8_t peerAddr[6] = {};
  bool isRemoteAddressSet = false;
  bool doConnect = false;

  bool createResources();
  void destroyResources();
  void updateConnectionEventGroup();
  PeerState *findPeerByHandle(uint32_t handle);
  const PeerState *findPeerByHandle(uint32_t handle) const;

  static void sppCallback(esp_spp_cb_event_t event, esp_spp_cb_param_t *param);
  static void gapCallback(esp_bt_gap_cb_event_t event, esp_bt_gap_cb_param_t *param);
  static void txTask(void *arg);
  static bool getNameFromEIR(const uint8_t *eir, char *bdname, uint8_t *bdname_len);

  // Non-owning pointer to the active instance; set during begin() and cleared
  // in end(). Ownership always stays with the per-instance _impl unique_ptr.
  static Impl *s_impl;
};

BluetoothSerial::Impl *BluetoothSerial::Impl::s_impl = nullptr;

void BluetoothSerial::Impl::updateConnectionEventGroup() {
  if (!sppEventGroup || !peersMtx) {
    return;
  }

  bool hasPeers = false;
  if (xSemaphoreTake(peersMtx, portMAX_DELAY) == pdTRUE) {
    hasPeers = !peers.empty();
    xSemaphoreGive(peersMtx);
  }

  if (hasPeers) {
    xEventGroupClearBits(sppEventGroup, SPP_DISCONNECTED);
    xEventGroupSetBits(sppEventGroup, SPP_CONNECTED);
  } else {
    xEventGroupClearBits(sppEventGroup, SPP_CONNECTED);
    xEventGroupSetBits(sppEventGroup, SPP_DISCONNECTED);
  }
}

PeerState *BluetoothSerial::Impl::findPeerByHandle(uint32_t handle) {
  for (auto &peer : peers) {
    if (peer.handle == handle) {
      return &peer;
    }
  }
  return nullptr;
}

