espressif/arduino-esp32/libraries/BluetoothSerial/src/BluetoothSerial.cpp
const PeerState *BluetoothSerial::Impl::findPeerByHandle(uint32_t handle) const {
  for (const auto &peer : peers) {
    if (peer.handle == handle) {
      return &peer;
    }
  }
  return nullptr;
}

bool BluetoothSerial::Impl::createResources() {
  peersMtx = xSemaphoreCreateMutex();
  rxQueue = xQueueCreate(RX_QUEUE_SIZE, sizeof(uint8_t));
  txQueue = xQueueCreate(TX_QUEUE_SIZE, sizeof(spp_packet_t *));
  txDone = xSemaphoreCreateBinary();
  sppEventGroup = xEventGroupCreate();
  btEventGroup = xEventGroupCreate();

  if (!peersMtx || !rxQueue || !txQueue || !txDone || !sppEventGroup || !btEventGroup) {
    destroyResources();
    return false;
  }

  BaseType_t ret = xTaskCreatePinnedToCore(txTask, "spp_tx", 4096, this, configMAX_PRIORITIES - 1, &txTaskHandle, 0);
  if (ret != pdPASS) {
    destroyResources();
    return false;
  }
  return true;
}

void BluetoothSerial::Impl::destroyResources() {
  if (txTaskHandle) {
    vTaskDelete(txTaskHandle);
    txTaskHandle = nullptr;
  }

  if (peersMtx) {
    if (xSemaphoreTake(peersMtx, portMAX_DELAY) == pdTRUE) {
      peers.clear();
      xSemaphoreGive(peersMtx);
    }
    vSemaphoreDelete(peersMtx);
    peersMtx = nullptr;
  }

  if (rxQueue) {
    vQueueDelete(rxQueue);
    rxQueue = nullptr;
  }

  if (txQueue) {
    spp_packet_t *pkt = nullptr;
    while (xQueueReceive(txQueue, &pkt, 0) == pdTRUE) {
      free(pkt);
    }
    vQueueDelete(txQueue);
    txQueue = nullptr;
  }

  if (txDone) {
    vSemaphoreDelete(txDone);
    txDone = nullptr;
  }

  if (sppEventGroup) {
    vEventGroupDelete(sppEventGroup);
    sppEventGroup = nullptr;
  }

  if (btEventGroup) {
    vEventGroupDelete(btEventGroup);
    btEventGroup = nullptr;
  }
}

void BluetoothSerial::Impl::txTask(void *arg) {
  auto *impl = static_cast<Impl *>(arg);
  spp_packet_t *pkt = nullptr;

  for (;;) {
    if (!impl->sppEventGroup || !(xEventGroupGetBits(impl->sppEventGroup) & SPP_RUNNING)) {
      vTaskDelay(pdMS_TO_TICKS(100));
      continue;
    }

    if (xQueueReceive(impl->txQueue, &pkt, portMAX_DELAY) != pdTRUE || !pkt) {
      continue;
    }

    EventBits_t bits = xEventGroupWaitBits(impl->sppEventGroup, SPP_CONNECTED, pdFALSE, pdFALSE, portMAX_DELAY);
    if (!(bits & SPP_CONNECTED)) {
      free(pkt);
      continue;
    }

    std::vector<uint32_t> handles;
    if (impl->peersMtx && xSemaphoreTake(impl->peersMtx, portMAX_DELAY) == pdTRUE) {
      if (pkt->broadcast) {
        handles.reserve(impl->peers.size());
        for (const auto &peer : impl->peers) {
          handles.push_back(peer.handle);
        }
      } else {
        for (const auto &peer : impl->peers) {
          if (memcmp(peer.address.data(), pkt->targetAddr, 6) == 0) {
            handles.push_back(peer.handle);
            break;
          }
        }
      }
      xSemaphoreGive(impl->peersMtx);
    }

    for (uint32_t handle : handles) {
      uint8_t *data = pkt->data;
      size_t len = pkt->len;

      while (len > 0) {
        bool peerActive = false;
        bool congested = false;

        if (impl->peersMtx && xSemaphoreTake(impl->peersMtx, portMAX_DELAY) == pdTRUE) {
          if (PeerState *peer = impl->findPeerByHandle(handle)) {
            peerActive = true;
            congested = peer->congested;
          }
          xSemaphoreGive(impl->peersMtx);
        }

        if (!peerActive) {
          break;
        }

        if (congested) {
          vTaskDelay(pdMS_TO_TICKS(5));
          continue;
        }

        size_t chunk = (len > SPP_TX_MAX) ? SPP_TX_MAX : len;
        esp_err_t err = esp_spp_write(handle, chunk, data);
        if (err != ESP_OK) {
          log_e("esp_spp_write: %s", esp_err_to_name(err));
          break;
        }
        xSemaphoreTake(impl->txDone, portMAX_DELAY);
        data += chunk;
        len -= chunk;
      }
    }

    free(pkt);
  }
}

bool BluetoothSerial::Impl::getNameFromEIR(const uint8_t *eir, char *bdname, uint8_t *bdname_len) {
  if (!eir) {
    return false;
  }

  const uint8_t *rmt_bdname = esp_bt_gap_resolve_eir_data(const_cast<uint8_t *>(eir), ESP_BT_EIR_TYPE_CMPL_LOCAL_NAME, bdname_len);
  if (!rmt_bdname) {
    rmt_bdname = esp_bt_gap_resolve_eir_data(const_cast<uint8_t *>(eir), ESP_BT_EIR_TYPE_SHORT_LOCAL_NAME, bdname_len);
  }

  if (rmt_bdname) {
    if (*bdname_len > ESP_BT_GAP_MAX_BDNAME_LEN) {
      *bdname_len = ESP_BT_GAP_MAX_BDNAME_LEN;
    }
    memcpy(bdname, rmt_bdname, *bdname_len);
    bdname[*bdname_len] = '\0';
    return true;
  }

  return false;
}

void BluetoothSerial::Impl::sppCallback(esp_spp_cb_event_t event, esp_spp_cb_param_t *param) {
  if (!s_impl) {
    return;
  }

  switch (event) {
    case ESP_SPP_INIT_EVT:
      log_i("SPP initialized");
      // Make the device connectable and put it in General Discoverable Mode so
      // remote devices can find it during an inquiry scan.
      // GAP scan modes: BT Core Spec v5.x, Vol 3, Part C, §4.2.2.
      esp_bt_gap_set_scan_mode(ESP_BT_CONNECTABLE, ESP_BT_GENERAL_DISCOVERABLE);
      if (!s_impl->isInitiator) {
        // Register an SPP server record in the local SDP database with
        // ESP_SPP_SEC_AUTHENTICATE security so the connection requires pairing.
        // SPP v1.2, §5.1 (service record); RFCOMM channel negotiation via SDP.
        esp_spp_start_srv(ESP_SPP_SEC_AUTHENTICATE, ESP_SPP_ROLE_SLAVE, 0, DEFAULT_SPP_NAME);
      }
      xEventGroupSetBits(s_impl->sppEventGroup, SPP_RUNNING);
      break;

    case ESP_SPP_SRV_OPEN_EVT:
    case ESP_SPP_OPEN_EVT:
    {
      uint32_t handle = (event == ESP_SPP_OPEN_EVT) ? param->open.handle : param->srv_open.handle;
      const uint8_t *bda = (event == ESP_SPP_OPEN_EVT) ? param->open.rem_bda : param->srv_open.rem_bda;
      log_i("SPP connected, handle=%u", handle);

      BTAddress address(bda, BTAddress::Type::Public);
      bool accepted = false;

      if (s_impl->peersMtx && xSemaphoreTake(s_impl->peersMtx, portMAX_DELAY) == pdTRUE) {
        if (s_impl->peers.size() < kMaxSppPeers) {
          PeerState peer;
          peer.handle = handle;
          peer.address = address;
          s_impl->peers.push_back(peer);
          accepted = true;
        }
        xSemaphoreGive(s_impl->peersMtx);
      }

      if (!accepted) {
        log_w("SPP peer limit reached, rejecting handle=%u", handle);
        esp_spp_disconnect(handle);
        break;
      }

      s_impl->updateConnectionEventGroup();
      if (s_impl->connectCb) {
        s_impl->connectCb(address);
      }
      break;
    }

