espressif/arduino-esp32/libraries/BluetoothSerial/src/BluetoothSerial.cpp
    case ESP_SPP_CLOSE_EVT:
    {
      uint32_t handle = param->close.handle;
      log_i("SPP disconnected, handle=%u", handle);
      BTAddress disconnectedAddr;
      bool found = false;

      if (s_impl->peersMtx && xSemaphoreTake(s_impl->peersMtx, portMAX_DELAY) == pdTRUE) {
        for (auto it = s_impl->peers.begin(); it != s_impl->peers.end(); ++it) {
          if (it->handle == handle) {
            disconnectedAddr = it->address;
            s_impl->peers.erase(it);
            found = true;
            break;
          }
        }
        xSemaphoreGive(s_impl->peersMtx);
      }

      if (found) {
        s_impl->updateConnectionEventGroup();
        if (s_impl->disconnectCb) {
          s_impl->disconnectCb(disconnectedAddr);
        }
      }
      break;
    }

    case ESP_SPP_DATA_IND_EVT:
    {
      BTAddress senderAddr;
      if (s_impl->peersMtx && xSemaphoreTake(s_impl->peersMtx, portMAX_DELAY) == pdTRUE) {
        if (const PeerState *peer = s_impl->findPeerByHandle(param->data_ind.handle)) {
          senderAddr = peer->address;
        }
        xSemaphoreGive(s_impl->peersMtx);
      }

      if (s_impl->peerDataCb && senderAddr) {
        s_impl->peerDataCb(senderAddr, param->data_ind.data, param->data_ind.len);
      } else if (s_impl->dataCb) {
        s_impl->dataCb(param->data_ind.data, param->data_ind.len);
      } else if (s_impl->rxQueue) {
        for (uint16_t i = 0; i < param->data_ind.len; i++) {
          if (xQueueSend(s_impl->rxQueue, &param->data_ind.data[i], 0) != pdTRUE) {
            log_w("RX queue full, dropping byte");
            break;
          }
        }
      }
      break;
    }

    case ESP_SPP_CONG_EVT:
      if (s_impl->peersMtx && xSemaphoreTake(s_impl->peersMtx, portMAX_DELAY) == pdTRUE) {
        if (PeerState *peer = s_impl->findPeerByHandle(param->cong.handle)) {
          peer->congested = param->cong.cong;
        }
        xSemaphoreGive(s_impl->peersMtx);
      }
      break;

    case ESP_SPP_WRITE_EVT:
      if (s_impl->txDone) {
        xSemaphoreGive(s_impl->txDone);
      }
      break;

    case ESP_SPP_DISCOVERY_COMP_EVT:
      // SDP ServiceSearchAttribute response for the SPP UUID has completed;
      // scn[0] is the RFCOMM channel number to connect on.
      // SPP v1.2, §5.1; SDP spec BT Core Spec v5.x, Vol 3, Part B.
      if (param->disc_comp.status == ESP_SPP_SUCCESS && s_impl->doConnect) {
        if (param->disc_comp.scn_num > 0) {
          esp_spp_connect(ESP_SPP_SEC_AUTHENTICATE, ESP_SPP_ROLE_MASTER, param->disc_comp.scn[0], s_impl->peerAddr);
        }
        s_impl->doConnect = false;
      }
      break;

    default: break;
  }
}

void BluetoothSerial::Impl::gapCallback(esp_bt_gap_cb_event_t event, esp_bt_gap_cb_param_t *param) {
  if (!s_impl) {
    return;
  }

  switch (event) {
    case ESP_BT_GAP_DISC_RES_EVT:
    {
      // Inquiry result: one device found during the inquiry (discovery) scan.
      // The EIR (Extended Inquiry Response) may include the remote device's name
      // when supported by the peer.
      // GAP Inquiry procedure: BT Core Spec v5.x, Vol 3, Part C, §4.4.2.
      // EIR data types: BT Core Spec v5.x, Vol 3, Part C, §8.1.
      BluetoothSerial::DiscoveryResult result;
      result.address = BTAddress(param->disc_res.bda, BTAddress::Type::Public);

      char bdname[ESP_BT_GAP_MAX_BDNAME_LEN + 1] = {};
      uint8_t bdname_len = 0;
      for (int i = 0; i < param->disc_res.num_prop; i++) {
        auto &prop = param->disc_res.prop[i];
        switch (prop.type) {
          case ESP_BT_GAP_DEV_PROP_BDNAME:
            if (prop.len <= ESP_BT_GAP_MAX_BDNAME_LEN) {
              memcpy(bdname, prop.val, prop.len);
              bdname[prop.len] = '\0';
            }
            break;
          case ESP_BT_GAP_DEV_PROP_COD:
            if (prop.len >= 4) {
              result.cod = *reinterpret_cast<uint32_t *>(prop.val);
            }
            break;
          case ESP_BT_GAP_DEV_PROP_RSSI:
            if (prop.len >= 1) {
              result.rssi = *reinterpret_cast<int8_t *>(prop.val);
            }
            break;
          case ESP_BT_GAP_DEV_PROP_EIR: getNameFromEIR(reinterpret_cast<uint8_t *>(prop.val), bdname, &bdname_len); break;
          default:                      break;
        }
      }
      result.name = String(bdname);

      if (s_impl->targetName.length() > 0 && result.name == s_impl->targetName) {
        memcpy(s_impl->peerAddr, param->disc_res.bda, 6);
        s_impl->isRemoteAddressSet = true;
        esp_bt_gap_cancel_discovery();
      }

      s_impl->discoveryResults.push_back(result);

      if (s_impl->discoveryCb) {
        s_impl->discoveryCb(result);
      }
      break;
    }

    case ESP_BT_GAP_DISC_STATE_CHANGED_EVT:
      if (param->disc_st_chg.state == ESP_BT_GAP_DISCOVERY_STOPPED) {
        xEventGroupSetBits(s_impl->btEventGroup, BT_DISCOVERY_COMPLETED);
        xEventGroupClearBits(s_impl->btEventGroup, BT_DISCOVERY_RUNNING);
      } else if (param->disc_st_chg.state == ESP_BT_GAP_DISCOVERY_STARTED) {
        xEventGroupSetBits(s_impl->btEventGroup, BT_DISCOVERY_RUNNING);
        xEventGroupClearBits(s_impl->btEventGroup, BT_DISCOVERY_COMPLETED);
      }
      break;

    case ESP_BT_GAP_PIN_REQ_EVT:
      // Legacy PIN pairing request from the remote device.
      // Per BT Core Spec v5.x, Vol 2, Part C, §4.1.7 (Authentication),
      // the local device MUST reply with either a PIN or an explicit reject;
      // leaving the request unanswered causes the remote side to time out.
      if (s_impl->pinCodeLen > 0) {
        esp_bt_gap_pin_reply(param->pin_req.bda, true, s_impl->pinCodeLen, s_impl->pinCode);
      } else {
        // No PIN configured: send an explicit negative reply so the peer gets
        // an immediate pairing-rejected indication rather than waiting for the
        // authentication timeout (typically 30 s).
        esp_bt_gap_pin_reply(param->pin_req.bda, false, 0, nullptr);
      }
      break;

    case ESP_BT_GAP_CFM_REQ_EVT:
    {
      // Secure Simple Pairing — Numeric Comparison model.
      // Both devices display param->cfm_req.num_val; the user must confirm that
      // both values match before authentication proceeds.
      // BT Core Spec v5.x, Vol 2, Part C, §4.2.4.1 (Numeric Comparison protocol).
      //
      // When no confirm callback is installed, the pairing is auto-accepted.
      // This is equivalent to the "Just Works" association model and provides no
      // MitM protection.  Install a ConfirmRequestHandler via onConfirmRequest()
      // to enforce out-of-band value confirmation.
      bool accept = true;
      if (s_impl->confirmRequestCb) {
        accept = s_impl->confirmRequestCb(param->cfm_req.num_val);
      } else {
        log_w("No confirm request callback, accepting pairing (Just Works — no MitM protection)");
      }
      esp_bt_gap_ssp_confirm_reply(param->cfm_req.bda, accept);
      break;
    }

    case ESP_BT_GAP_AUTH_CMPL_EVT:
      // Authentication complete: indicates whether pairing (legacy or SSP) succeeded.
      // BT Core Spec v5.x, Vol 2, Part C, §4.2.5 (Authentication and Pairing Complete).
      if (s_impl->authCompleteCb) {
        s_impl->authCompleteCb(param->auth_cmpl.stat == ESP_BT_STATUS_SUCCESS);
      }
      break;

    case ESP_BT_GAP_REMOVE_BOND_DEV_COMPLETE_EVT: xEventGroupSetBits(s_impl->btEventGroup, BT_BOND_REMOVE_COMPLETED); break;

