espressif/arduino-esp32/libraries/BluetoothSerial/src/BluetoothSerial.cpp
    default: break;
  }
}

// --------------------------------------------------------------------------
// BluetoothSerial public API
// --------------------------------------------------------------------------

BluetoothSerial::BluetoothSerial() : _impl(std::make_unique<Impl>()) {}

BluetoothSerial::~BluetoothSerial() {
  if (_impl && _impl->initialized) {
    end(false);
  }
}

BTStatus BluetoothSerial::begin(const String &localName, bool isInitiator) {
  if (!_impl) {
    return BTStatus::InvalidState;
  }

  if (_impl->initialized) {
    return BTStatus::OK;
  }

  if (Impl::s_impl) {
    return BTStatus::Busy;
  }

  _impl->localName = localName;
  _impl->isInitiator = isInitiator;

  if (!btStarted() && !btStart()) {
    log_e("btStart() failed");
    return BTStatus::Fail;
  }

  esp_err_t err = esp_bluedroid_init();
  if (err != ESP_OK) {
    log_e("esp_bluedroid_init: %s", esp_err_to_name(err));
    return BTStatus::Fail;
  }

  err = esp_bluedroid_enable();
  if (err != ESP_OK) {
    log_e("esp_bluedroid_enable: %s", esp_err_to_name(err));
    esp_bluedroid_deinit();
    return BTStatus::Fail;
  }

  err = esp_bt_gap_register_callback(Impl::gapCallback);
  if (err != ESP_OK) {
    log_e("esp_bt_gap_register_callback: %s", esp_err_to_name(err));
    esp_bluedroid_disable();
    esp_bluedroid_deinit();
    return BTStatus::Fail;
  }

  err = esp_spp_register_callback(Impl::sppCallback);
  if (err != ESP_OK) {
    log_e("esp_spp_register_callback: %s", esp_err_to_name(err));
    esp_bluedroid_disable();
    esp_bluedroid_deinit();
    return BTStatus::Fail;
  }

  esp_spp_cfg_t cfg = BT_SPP_DEFAULT_CONFIG();
  cfg.mode = ESP_SPP_MODE_CB;
  err = esp_spp_enhanced_init(&cfg);
  if (err != ESP_OK) {
    log_e("esp_spp_enhanced_init: %s", esp_err_to_name(err));
    esp_bluedroid_disable();
    esp_bluedroid_deinit();
    return BTStatus::Fail;
  }

  if (localName.length() > 0) {
    esp_bt_gap_set_device_name(localName.c_str());
  }

  if (_impl->sspEnabled) {
    // Secure Simple Pairing I/O capability announcement.
    // The local device's IO capability determines which SSP association model
    // is selected (Numeric Comparison, Passkey Entry, Just Works, or OOB).
    // IO capability definitions and association model selection table:
    // BT Core Spec v5.x, Vol 2, Part C, §4.2.1 (IO Capabilities) and
    // §4.2.2.3 (Mapping IO Capabilities to Authentication Stage 1).
    esp_bt_sp_param_t param_type = ESP_BT_SP_IOCAP_MODE;
    esp_bt_io_cap_t iocap;
    if (_impl->ioCapInput && _impl->ioCapOutput) {
      iocap = ESP_BT_IO_CAP_IO;
    } else if (_impl->ioCapInput) {
      iocap = ESP_BT_IO_CAP_IN;
    } else if (_impl->ioCapOutput) {
      iocap = ESP_BT_IO_CAP_OUT;
    } else {
      iocap = ESP_BT_IO_CAP_NONE;
    }
    esp_bt_gap_set_security_param(param_type, &iocap, sizeof(esp_bt_io_cap_t));
  } else if (_impl->pinCodeLen > 0) {
    esp_bt_pin_type_t pinType = ESP_BT_PIN_TYPE_FIXED;
    esp_bt_gap_set_pin(pinType, _impl->pinCodeLen, _impl->pinCode);
  }

  if (!_impl->createResources()) {
    log_e("Failed to allocate BluetoothSerial resources");
    return BTStatus::NoMemory;
  }

  Impl::s_impl = _impl.get();
  _impl->initialized = true;

  EventBits_t bits = xEventGroupWaitBits(_impl->sppEventGroup, SPP_RUNNING, pdFALSE, pdTRUE, pdMS_TO_TICKS(5000));
  if (!(bits & SPP_RUNNING)) {
    log_e("SPP server failed to start within timeout");
    _impl->initialized = false;
    Impl::s_impl = nullptr;
    _impl->destroyResources();
    return BTStatus::Timeout;
  }

  return BTStatus::OK;
}

void BluetoothSerial::end(bool releaseMemory) {
  if (!_impl || !_impl->initialized) {
    return;
  }

  _impl->initialized = false;
  Impl::s_impl = nullptr;

  esp_spp_deinit();
  esp_bluedroid_disable();
  esp_bluedroid_deinit();

  btStop();

  if (releaseMemory) {
    btMemRelease(BT_MODE_CLASSIC_BT);
  }

  _impl->destroyResources();
}

int BluetoothSerial::available() {
  if (!_impl || !_impl->rxQueue) {
    return 0;
  }

  return uxQueueMessagesWaiting(_impl->rxQueue);
}

int BluetoothSerial::peek() {
  if (!_impl || !_impl->rxQueue) {
    return -1;
  }

  uint8_t c;
  if (xQueuePeek(_impl->rxQueue, &c, 0) == pdTRUE) {
    return c;
  }

  return -1;
}

int BluetoothSerial::read() {
  if (!_impl || !_impl->rxQueue) {
    return -1;
  }

  uint8_t c;
  if (xQueueReceive(_impl->rxQueue, &c, 0) == pdTRUE) {
    return c;
  }

  return -1;
}

size_t BluetoothSerial::write(uint8_t c) {
  return write(&c, 1);
}

size_t BluetoothSerial::write(const uint8_t *buf, size_t len) {
  if (!_impl || !_impl->txQueue || !_impl->initialized || len == 0) {
    return 0;
  }

  auto *pkt = static_cast<spp_packet_t *>(malloc(sizeof(spp_packet_t) + len));
  if (!pkt) {
    return 0;
  }

  pkt->len = len;
  pkt->broadcast = true;
  memset(pkt->targetAddr, 0, sizeof(pkt->targetAddr));
  memcpy(pkt->data, buf, len);

  if (xQueueSend(_impl->txQueue, &pkt, pdMS_TO_TICKS(1000)) != pdTRUE) {
    free(pkt);
    return 0;
  }

  return len;
}

size_t BluetoothSerial::writeTo(const BTAddress &address, const uint8_t *buf, size_t len) {
  if (!_impl || !_impl->txQueue || !_impl->initialized || !buf || len == 0 || !address) {
    return 0;
  }

  auto *pkt = static_cast<spp_packet_t *>(malloc(sizeof(spp_packet_t) + len));
  if (!pkt) {
    return 0;
  }

  pkt->len = len;
  pkt->broadcast = false;
  memcpy(pkt->targetAddr, address.data(), sizeof(pkt->targetAddr));
  memcpy(pkt->data, buf, len);

  if (xQueueSend(_impl->txQueue, &pkt, pdMS_TO_TICKS(1000)) != pdTRUE) {
    free(pkt);
    return 0;
  }

  return len;
}

void BluetoothSerial::flush() {
  if (!_impl || !_impl->txQueue) {
    return;
  }

  while (uxQueueMessagesWaiting(_impl->txQueue) > 0) {
    delay(5);
  }
}

BTStatus BluetoothSerial::connect(const String &remoteName, uint32_t timeoutMs) {
  if (!_impl || !_impl->initialized) {
    return BTStatus::NotInitialized;
  }

  _impl->targetName = remoteName;
  _impl->isRemoteAddressSet = false;
  _impl->doConnect = true;

