espressif/arduino-esp32/libraries/BluetoothSerial/src/BluetoothSerial.cpp
  xEventGroupClearBits(_impl->btEventGroup, BT_DISCOVERY_COMPLETED);
  esp_bt_gap_start_discovery(ESP_BT_INQ_MODE_GENERAL_INQUIRY, (timeoutMs / 1280) + 1, 0);

  EventBits_t bits = xEventGroupWaitBits(_impl->btEventGroup, BT_DISCOVERY_COMPLETED, pdTRUE, pdTRUE, pdMS_TO_TICKS(timeoutMs + 2000));

  if (!_impl->isRemoteAddressSet) {
    _impl->targetName = "";
    return BTStatus::Fail;
  }

  esp_spp_start_discovery(_impl->peerAddr);

  bits = xEventGroupWaitBits(_impl->sppEventGroup, SPP_CONNECTED, pdFALSE, pdTRUE, pdMS_TO_TICKS(timeoutMs));
  if (!(bits & SPP_CONNECTED)) {
    return BTStatus::Timeout;
  }

  _impl->targetName = "";
  return BTStatus::OK;
}

BTStatus BluetoothSerial::connect(const BTAddress &address, uint8_t channel) {
  if (!_impl || !_impl->initialized) {
    return BTStatus::NotInitialized;
  }

  memcpy(_impl->peerAddr, address.data(), 6);
  _impl->isRemoteAddressSet = true;
  _impl->doConnect = true;

  if (channel > 0) {
    esp_spp_connect(ESP_SPP_SEC_AUTHENTICATE, ESP_SPP_ROLE_MASTER, channel, _impl->peerAddr);
  } else {
    esp_spp_start_discovery(_impl->peerAddr);
  }

  EventBits_t bits = xEventGroupWaitBits(_impl->sppEventGroup, SPP_CONNECTED, pdFALSE, pdTRUE, pdMS_TO_TICKS(10000));
  if (!(bits & SPP_CONNECTED)) {
    return BTStatus::Timeout;
  }

  return BTStatus::OK;
}

BTStatus BluetoothSerial::disconnect() {
  if (!_impl || !_impl->initialized) {
    return BTStatus::NotInitialized;
  }

  std::vector<uint32_t> handles;
  if (_impl->peersMtx && xSemaphoreTake(_impl->peersMtx, portMAX_DELAY) == pdTRUE) {
    handles.reserve(_impl->peers.size());
    for (const auto &peer : _impl->peers) {
      handles.push_back(peer.handle);
    }
    xSemaphoreGive(_impl->peersMtx);
  }

  if (handles.empty()) {
    return BTStatus::OK;
  }

  for (uint32_t handle : handles) {
    esp_spp_disconnect(handle);
  }

  uint32_t deadline = millis() + 5000;
  while (peerCount() > 0 && static_cast<int32_t>(millis() - deadline) < 0) {
    delay(10);
  }

  return peerCount() == 0 ? BTStatus::OK : BTStatus::Timeout;
}

BTStatus BluetoothSerial::disconnect(const BTAddress &address) {
  if (!_impl || !_impl->initialized) {
    return BTStatus::NotInitialized;
  }
  if (!address) {
    return BTStatus::InvalidParam;
  }

  uint32_t handle = 0;
  if (_impl->peersMtx && xSemaphoreTake(_impl->peersMtx, portMAX_DELAY) == pdTRUE) {
    for (const auto &peer : _impl->peers) {
      if (peer.address == address) {
        handle = peer.handle;
        break;
      }
    }
    xSemaphoreGive(_impl->peersMtx);
  }

  if (handle == 0) {
    return BTStatus::NotFound;
  }

  esp_spp_disconnect(handle);

  uint32_t deadline = millis() + 5000;
  while (static_cast<int32_t>(millis() - deadline) < 0) {
    bool stillConnected = false;
    if (_impl->peersMtx && xSemaphoreTake(_impl->peersMtx, portMAX_DELAY) == pdTRUE) {
      for (const auto &peer : _impl->peers) {
        if (peer.address == address) {
          stillConnected = true;
          break;
        }
      }
      xSemaphoreGive(_impl->peersMtx);
    }
    if (!stillConnected) {
      return BTStatus::OK;
    }
    delay(10);
  }

  return BTStatus::Timeout;
}

bool BluetoothSerial::connected() const {
  if (!_impl || !_impl->sppEventGroup) {
    return false;
  }

  return (xEventGroupGetBits(_impl->sppEventGroup) & SPP_CONNECTED) != 0;
}

bool BluetoothSerial::hasClient() const {
  return peerCount() > 0;
}

size_t BluetoothSerial::peerCount() const {
  if (!_impl || !_impl->peersMtx) {
    return 0;
  }

  size_t count = 0;
  if (xSemaphoreTake(_impl->peersMtx, portMAX_DELAY) == pdTRUE) {
    count = _impl->peers.size();
    xSemaphoreGive(_impl->peersMtx);
  }
  return count;
}

std::vector<BTAddress> BluetoothSerial::peers() const {
  std::vector<BTAddress> result;
  if (!_impl || !_impl->peersMtx) {
    return result;
  }

  if (xSemaphoreTake(_impl->peersMtx, portMAX_DELAY) == pdTRUE) {
    result.reserve(_impl->peers.size());
    for (const auto &peer : _impl->peers) {
      result.push_back(peer.address);
    }
    xSemaphoreGive(_impl->peersMtx);
  }
  return result;
}

std::vector<BluetoothSerial::DiscoveryResult> BluetoothSerial::discover(uint32_t timeoutMs) {
  if (!_impl || !_impl->initialized) {
    return {};
  }

  _impl->discoveryResults.clear();
  _impl->targetName = "";

  xEventGroupClearBits(_impl->btEventGroup, BT_DISCOVERY_COMPLETED);
  esp_bt_gap_start_discovery(ESP_BT_INQ_MODE_GENERAL_INQUIRY, (timeoutMs / 1280) + 1, 0);
  xEventGroupWaitBits(_impl->btEventGroup, BT_DISCOVERY_COMPLETED, pdTRUE, pdTRUE, pdMS_TO_TICKS(timeoutMs + 2000));

  return _impl->discoveryResults;
}

BTStatus BluetoothSerial::discoverAsync(DiscoveryHandler callback, uint32_t timeoutMs) {
  if (!_impl || !_impl->initialized) {
    return BTStatus::NotInitialized;
  }

  _impl->discoveryCb = std::move(callback);
  _impl->discoveryResults.clear();
  _impl->targetName = "";

  xEventGroupClearBits(_impl->btEventGroup, BT_DISCOVERY_COMPLETED);
  esp_err_t err = esp_bt_gap_start_discovery(ESP_BT_INQ_MODE_GENERAL_INQUIRY, (timeoutMs / 1280) + 1, 0);
  return (err == ESP_OK) ? BTStatus::OK : BTStatus::Fail;
}

BTStatus BluetoothSerial::discoverStop() {
  if (!_impl || !_impl->initialized) {
    return BTStatus::NotInitialized;
  }

  _impl->discoveryCb = nullptr;
  esp_err_t err = esp_bt_gap_cancel_discovery();
  return (err == ESP_OK) ? BTStatus::OK : BTStatus::Fail;
}

void BluetoothSerial::enableSSP(bool input, bool output) {
  if (!_impl) {
    return;
  }

  _impl->sspEnabled = true;
  _impl->ioCapInput = input;
  _impl->ioCapOutput = output;
}

void BluetoothSerial::disableSSP() {
  if (_impl) {
    _impl->sspEnabled = false;
  }
}

void BluetoothSerial::setPin(const char *pin) {
  if (!_impl || !pin) {
    return;
  }

  size_t len = strlen(pin);
  if (len > 16) {
    len = 16;
  }

  memcpy(_impl->pinCode, pin, len);
  _impl->pinCodeLen = len;
}

BTStatus BluetoothSerial::onConfirmRequest(ConfirmRequestHandler callback) {
  if (!_impl) {
    return BTStatus::InvalidState;
  }

