espressif/arduino-esp32/libraries/BluetoothSerial/src/BluetoothSerial.cpp
  _impl->confirmRequestCb = std::move(callback);
  return BTStatus::OK;
}

BTStatus BluetoothSerial::onAuthComplete(AuthCompleteHandler callback) {
  if (!_impl) {
    return BTStatus::InvalidState;
  }

  _impl->authCompleteCb = std::move(callback);
  return BTStatus::OK;
}

std::vector<BTAddress> BluetoothSerial::getBondedDevices() {
  std::vector<BTAddress> result;
  int count = esp_bt_gap_get_bond_device_num();
  if (count <= 0) {
    return result;
  }

  auto *list = static_cast<esp_bd_addr_t *>(malloc(count * sizeof(esp_bd_addr_t)));
  if (!list) {
    return result;
  }

  esp_err_t err = esp_bt_gap_get_bond_device_list(&count, list);
  if (err == ESP_OK) {
    for (int i = 0; i < count; i++) {
      result.push_back(BTAddress(list[i], BTAddress::Type::Public));
    }
  }

  free(list);
  return result;
}

BTStatus BluetoothSerial::deleteBond(const BTAddress &address) {
  if (!_impl || !_impl->initialized) {
    return BTStatus::InvalidState;
  }
  esp_bd_addr_t bda;
  memcpy(bda, address.data(), 6);
  xEventGroupClearBits(_impl->btEventGroup, BT_BOND_REMOVE_COMPLETED);
  esp_err_t err = esp_bt_gap_remove_bond_device(bda);
  if (err != ESP_OK) {
    return BTStatus::Fail;
  }
  EventBits_t bits = xEventGroupWaitBits(_impl->btEventGroup, BT_BOND_REMOVE_COMPLETED, pdTRUE, pdTRUE, pdMS_TO_TICKS(2000));
  if (!(bits & BT_BOND_REMOVE_COMPLETED)) {
    log_w("deleteBond: timeout waiting for removal confirmation");
  }
  return BTStatus::OK;
}

BTStatus BluetoothSerial::deleteAllBonds() {
  auto devices = getBondedDevices();
  for (const auto &addr : devices) {
    BTStatus status = deleteBond(addr);
    if (!status) {
      return status;
    }
  }

  return BTStatus::OK;
}

BTStatus BluetoothSerial::onData(DataHandler callback) {
  if (!_impl) {
    return BTStatus::InvalidState;
  }

  _impl->dataCb = std::move(callback);
  return BTStatus::OK;
}

BTStatus BluetoothSerial::onConnect(PeerConnectHandler callback) {
  if (!_impl) {
    return BTStatus::InvalidState;
  }

  _impl->connectCb = std::move(callback);
  return BTStatus::OK;
}

BTStatus BluetoothSerial::onDisconnect(PeerDisconnectHandler callback) {
  if (!_impl) {
    return BTStatus::InvalidState;
  }

  _impl->disconnectCb = std::move(callback);
  return BTStatus::OK;
}

BTStatus BluetoothSerial::onPeerData(PeerDataHandler callback) {
  if (!_impl) {
    return BTStatus::InvalidState;
  }

  _impl->peerDataCb = std::move(callback);
  return BTStatus::OK;
}

BTAddress BluetoothSerial::getAddress() const {
  if (!_impl || !_impl->initialized) {
    return BTAddress();
  }

  const uint8_t *addr = esp_bt_dev_get_address();
  if (!addr) {
    return BTAddress();
  }

  return BTAddress(addr, BTAddress::Type::Public);
}

BluetoothSerial::operator bool() const {
  return _impl && _impl->initialized;
}

#endif /* SOC_BT_SUPPORTED && CONFIG_BT_ENABLED && CONFIG_BLUEDROID_ENABLED */
